#Задача 1===============================================================
import math
print("1. Записати умову належності точки площини з координатами (x, y) \nдо зафарбованої області.")
x = float(input("Координата х = "))
y = float(input("Координата y = "))
a = bool(y >=abs(x) and y <= 1)
b = bool(x >= -1 and x <= 1 and y >= -1 and y <= 1)
c = bool(x >= 0 and x <= 2 and y >= 0 and y <= 1)
d = bool((x >= 0 and x <= 2 and (y >= x-2 or y <= -x+2)) or
         (x>=-2 and x<=0 and (y<=math.sqrt(4-x**2) or y>=-math.sqrt(4-x**2))))
e = bool((y<=math.sqrt(4-x**2) and (y>=-x+2 or y>=x+2)) or
         (y>=-math.sqrt(4-x**2) and (y<=-x-2 or y<=x-2)))
f = bool(x>=-2 and ((y>=math.sqrt(4-x**2) and y<=2 and x<=0) or
                    (y<=-math.sqrt(4-x**2) and y>=-2 and x<=2)))
print("Варіант A - ", a)
print("Варіант Б - ", b)
print("Варіант В - ", c)
print("Варіант Г - ", d)
print("Варіант Д - ", e)
print("Варіант Е - ", f)


#Задача 2===============================================================
print("\n2. Точка площини задана декартовими координатами (x, y). \nПеревірити чи належить вона третьому координатному квадранту.")
x = float(input('Введіть x = '))
y = float(input('Введіть y = '))
if x <= 0 and y <= 0:
    print("Точка (",x,",",y,") належить третьому координатному квадранту.")
else:
    print("Точка (",x,",",y,") НЕ належить третьому координатному квадранту.")


#Задача 3===============================================================
print("\n3. Записати умови, що істинні тоді й тільки тоді, коли:")
print("a) натуральне число n – парне")
n = float(input("Введіть n = "))
if n%2 == 0:
    print("Число",n,"парне")
else:
    print("Число",n,"НЕ парне")

print("b) остання цифра числа n – 0. Нехай, задане двозначне число")
n = float(input("Введіть n = "))
if n%10 == 0:
    print("Остання цифра числа",n,"є 0")
else:
    print("Остання цифра числа",n,"НЕ є 0")

print("c) сума першої і другої цифри двозначного натурального \nчисла n – двозначне число")
n = float(input("Введіть n = "))
if ((n//10)+(n%10))//10 != 0:
    print("Сума цифр двозначного числа %f є чило двозначне:%f" %(n,(n//10)+(n%10)))
else:
    print("Сума цифр двозначного числа %f НЕ є чило двозначне:%f" %(n,(n//10)+(n%10)))    


#Задача 4===============================================================
print("\n4. Дано тризначне число. Перевірити чи")
x = float(input("Введіть x = "))
print("a) містить воно цифру 2")
if x//100 == 2:
    print("Цифра 2 міститься у",x)
elif (x%100)//10 == 2:
    print("Цифра 2 міститься у",x)
elif x%10 == 2:
    print("Цифра 2 міститься у",x)
else:
    print("Цифра 2 не міститься у",x)

print("b) складається лише з парних чисел")
if ((x//100)%2 == 0) and (((x%100)//10)%2 == 0) and (x%2 == 0):
    print("Число",x,"складається з парних чисел")
else:
    print("Число",x,"не складається лише з парних чисел")

print("c) сума його цифр дорівнює 18")
z1 = x//100
z2 = (x%100)//10
z3 = x%10
z = z1+z2+z3
if z == 18:
    print(z1,"+",z2,"+",z3,"=",18)
else:
    print(z1,"+",z2,"+",z3,"не =",18)


#Задача 5===============================================================
print("\n5. Для заданого x обчислити значення функцій")
x = float(input("Введіть x = "))
if x<=0:
    print("Відповідь: 0")
elif 0<x and x<=1:
    print("Відповідь:",x**2)
else:
    print("Відповідь:",x**4)


#Задача 6===============================================================
print("\n6. Перевірити впорядкованість змінних a, b, c:")
a = float(input("a = "))
b = float(input("b = "))
c = float(input("c = "))
print(a,b,c)
print("a) за зростанням їхніх значень")
if a<b and b<c:
    print("Відповідь: Впорядковано за зростанням")
else:
    print("Відповідь: Невпорядковано за зростанням")

print("b) за спаданням їхніх значень")
if a>b and b>c:
    print("Відповідь: Впорядковано за спаданням")
else:
    print("Відповідь: Невпорядковано за спаданням")

print("c) за зростанням(1) чи спаданням(2) їхніх значень")
if a > b and a > c:
    g = a
    if b > c:
        g1 = b
        g2 = c
    else:    
        g1 = c
        g2 = b
elif b > a and b > c:
    g = b
    if a > c:
        g1 = a
        g2 = c
    else:    
        g1 = c
        g2 = a
elif a > b:
    g1 = a
    g2 = b
    g = c
else:    
    g1 = b
    g2 = a
    g = c
q = int(input("Введіть число дії - "))
if q==1:    
    print("Впорядковано за зростанням %u %u %u"%(g2,g1,g))
if q==2:
    print("Впорядковано за спаданням %u %u %u"%(g,g1,g2))


#Задача 7===============================================================
print("\n7. Визначити більше та менше з двох чисел, введених з клавіатури.")
a = float(input("a = "))
b = float(input("b = "))
if a>b:
    d = a
    e = b
else:
    d = b
    e = a
print("Найбільше =",d,"\nНайменше =",e)


#Задача 8===============================================================
print("\n8. Дано три дійсних числа x, y і z. Скласти програми для знаходження:")
x = float(input("x = "))
y = float(input("y = "))
z = float(input("z = "))
print("a) найбільшого за модулем")
if abs(x) > abs(y) and abs(x) > abs(z):
    print("Відповідь: ",x)
elif abs(y) > abs(x) and abs(y) > abs(z):
    print("Відповідь: ",y)
else:
    print("Відповідь: ",z)

print("b) найменшого за модулем")
if abs(x) < abs(y) and abs(x) < abs(z):
    print("Відповідь: ",x)
elif abs(y) < abs(x) and abs(y) < abs(z):
    print("Відповідь: ",y)
else:
    print("Відповідь: ",z)

print("c) max(x + y + z, xy − xz + yz, xyz) ;")
a = x+y+z
b = x*y-x*z+y*z
c = x*y*z
if a > b:
    d = a
    e = "x+y+z ="
else:
    d = b
    e = "x*y−x*z+y*z ="
if c > d:
    d = c
    e = "x*y*z ="
print("Відповідь: ",e,d)

print("d) max(xy, xz, yz)")
a = x*y
b = x*z
c = y*z
if a > b:
    d = a
    e = "x*y ="
else:
    d = b
    e = "x*z ="
if c > d:
    d = c
    e = "y*z ="
print("Відповідь: ",e,d)


#Задача 9===============================================================
print("\n9. Дано три дійсних числа x, y, z. Визначити кількість:")
x = float(input("x = "))
y = float(input("y = "))
z = float(input("z = "))
print("a) різних серед них")
if x != y and x != z and y != z:
    a = 3
elif x != y or x != z or y != z:
    a = 2
else:
    a = 0
print("Відповідь: ",a)    

print("b) однакових серед них")
if x == y and x == z and y == z:
    b = 3
elif x == y or x == z or y == z:
    b = 2
else:
    b = 0
print("Відповідь: ",b)    

print("c) чисел, що є більшими за їхнє середнє арифметичне значення")
c = (x+y+z)/3
if c < x and c < y and c < z:
    d = 3
elif ((c < x and c < y) or (c < x and c < z) or (c < y and c < z)):
    d = 2
elif c < x or c < y or c < z:
    d = 1
else:
    d = 0
print("Відповідь: ",d)     

print("d) чисел, що є більшими за введене з клавіатури число a")
e = float(input("a = "))
if e<x and e<y and e<z:
    f = 3
elif ((e<x and e<y) or (e<x and e<z) or (e<y and e<z)):
    f = 2
elif e<x or e<y or e<z:
    f = 1
else:
    f = 0
print("Відповідь: ",f)


#Задача 10==============================================================
print("\n10. Перевірити, чи існує трикутник із заданими сторонами a, b, c. \nЯкщо так, то визначити, який він.")
a = float(input("Сторона a = "))
b = float(input("Сторона b = "))
c = float(input("Сторона c = "))
if (a<=0) or (b<=0) or (c<=0):
    print("Не існує відємної або нульової сторони.")
else:
    if (a+b<=c) or (a+c<=b) or (c+b<=a):
        print("З відрізків такої довжини утворити трикутник неможливо.")
    else:
        if (a**2+b**2==c**2) or (a**2+c**2==b**2) or (c**2+b**2==a**2):
            print("Прямокутний трикутник")
        elif (a**2+b**2>c**2) or (a**2+c**2>b**2) or (c**2+b**2>a**2):
            print("Гострокутний трикутник")
        elif (a**2+b**2<c**2) or (a**2+c**2<b**2) or (c**2+b**2<a**2):
            print("Тупокутній ттрикутник")


#Задача 11==============================================================
print("\n11. Визначити кількість днів у заданому місяці.")
m = int(input("Введіть номер місяця - "))
d = 0
if m == 1:
    d = 31
elif m == 2:
    d = 28
elif m == 3:
    d = 31
elif m == 4:
    d = 30
elif m == 5:
    d = 31
elif m == 6:
    d = 30
elif m == 7:
    d = 31
elif m == 8:
    d = 31
elif m == 9:
    d = 30
elif m == 10:
    d = 31
elif m == 11:
    d = 30
elif m == 12:
    d = 31
else:
    print("Немає такого місяця")
print("Кількість днів у ", m, " місяці: ", d)
