#Задача 1===============================================================
def perevirka1(a, b, c):
    if (a <= 0) or (b <= 0) or (c <= 0):
        print("Не існує відємної або нульової сторони.")
    elif (a + b <= c) or (a + c <= b) or (c + b <= a):
        print("З відрізків такої довжини утворити трикутник неможливо.")
    elif (a ** 2 + b ** 2 == c ** 2) or (a ** 2 + c ** 2 == b ** 2) or (c ** 2 + b ** 2 == a ** 2):
        print("Прямокутний трикутник")
    elif (a ** 2 + b ** 2 < c ** 2) or (a ** 2 + c ** 2 < b ** 2) or (c ** 2 + b ** 2 < a ** 2):
        print("Тупокутній трикутник")
    elif (a ** 2 + b ** 2 > c ** 2) or (a ** 2 + c ** 2 > b ** 2) or (c ** 2 + b ** 2 > a ** 2):
        print("Гострокутний трикутник")

print('''1. Перевірити (у функції), чи існує трикутник із заданими сторонами
 a, b, c. Якщо так, то визначити, який він: гострокутний, прямокутний, 
 тупокутний.''')

x = float(input("Сторона a = "))
y = float(input("Сторона b = "))
z = float(input("Сторона c = "))
perevirka1(x, y, z)


#Задача 2===============================================================
def perevirka2(y, z):
    if y <= 0 and z <= 0:
        return print("Точка (", y, ",", z, ") належить третьому координатному квадранту.")
    else:
        return print("Точка (", y, ",", z, ") НЕ належить третьому координатному квадранту.")

print('''\n2. Точка площини задана декартовими координатами (y, z). Перевірити
 (у функції) чи належить вона третьому координатному квадранту.''')

a = float(input('Введіть координату y = '))
b = float(input('Введіть координату z = '))
perevirka2(a, b)


#Задача 3===============================================================
import random

def perevirka3(elem, q):
    if elem % q == 0:
        return True

print('''\n3. Задано цілі числа n і p та натуральні числа a1, . . . , an.
 Скласти програму обчислення добутку членів послідовності, кратних p.
 Перевірку кратності винести у функцію.''')

n = int(input("Введіть число n = "))
p = int(input("Число p = "))
a = [random.randint(1, 10) for i in range(n)]
print(a)

m = False
dob = 1
for ii in a:
    if perevirka3(ii, p) == True:
        dob *= ii
        m = True
if m == True:
    print("Добуток чисел:", dob)
else:
    print("Немає кратних числу", p)


#Задача 4===============================================================
def perevirka4(x, y):
    i = 1
    m = False
    while x // i != 0:
        z = (x // i) % 10
        if z == y:
            print("Цифра {} входить в число {}".format(y, x))
            m = True
        i *= 10
    if m == False:
        print("Цифра %u НЕ входить в число %u" % (y, x))
         
print('''\n4. Створити програму, яка з’ясовує, чи входить задана цифра до 
запису заданого натурального числа. Перевірку винести у функцію.''')

a = int(input("Задане число a = "))
b = int(input("Цифра b = "))
perevirka4(a, b)


#Задача 5===============================================================
import random

def perevirka5(e, c):
    if e > c:
        return True
    elif e < c:
        return False

print('''\n5. Дано список чисел. Знайти кількість елементів списку, більших\менших
 за задане число k. Перевірку (більший-менший) винести у функцію.''')

n = int(input('Розмір списку n = '))
k = int(input('Число k = '))
a = [random.randint(1, 10) for i in range(n)]
print(a)

kilb = 0
kilm = 0
for elem in a:
    if perevirka5(elem, k) == True:
        kilb += 1
    elif perevirka5(elem, k) == False:
        kilm += 1
print('a) Кількість більших -', kilb)
print('b) Кількість менших -', kilm)