#Задача 1.1=============================================================
print("1.1. Вивести на екран таблицю")
print("x",1,2,3,4,5, sep=" | ")
print("у",3,1,5,4,2, sep=" | ")


#Задача 1.2=============================================================
print("\n1.2. Дано натуральне тризначне число. Знайти суму цифр цього числа.")
a = float(input("Число = "))
b1 = a//100	  #Знаходимо перше число з розряду сотих
b2 = (a%100)//10  #Знаходимо друге число з розряду десятків
b3 = a%10     	  #Знаходимо трееє число з розряду одиниць
b = b1+b2+b3
print("Сума = ", b)


#Задача 1.3=============================================================
print("\n1.3.Обчислити гіпотенузу c прямокутного трикутника за катетами a та b.")
import math
a = float(input("Катет 1 = "))
b = float(input("Катет 2 = "))
#c = math.sqrt(a**2+b**2)
c = math.hypot(a,b)  #Можна використати Функцію з бібліотеки 'math'
print("Гипотенуза = ", c)


#Задача 1.4=============================================================
print("\n1.4.Обчислити значення многочлена для введеного з клавіатури \nкомплексного числа 𝑧:")
print("1) f(x)=4c^4+3c^3+2c^2+c+1")
print("2) f(x)=c4+2c^2+1")
x = float(input("Реальна частина = "))
y = float(input("Уявна частина = "))
c = complex(x,y)
d = 4*c**4+3*c**3+2*c**2+c+1
e = c**4+2*c**2+1
print(d);print(e)


#Задача 1.5=============================================================
print("\n1.5. Вивести на екран рисунки:")
print("a)          b)          c)")
print("      *       * * * * *      *******")
print("    * * *     * *   * *    *         *")
print("  * * * * *   *   *   *   * H e l l o *")
print("    * * *     * *   * *    *         *")
print("      *       * * * * *      *******")


#Задача 1.6=============================================================
import math
print("\n1.6. Обчислити площу трикутника 𝑆 за трьома сторонами 𝑎, 𝑏, 𝑐.")
a = float(input('Сторона a = '))
b = float(input('Сторона b = '))
c = float(input('Сторона c = '))
p = (a+b+c)/2
s = math.sqrt(p*(p-a)*(p-b)*(p-c)) 
print("Площа = ", s)


#Задача 1.7=============================================================
import math
print("\n1.7. Знайти довжини всіх медіан, бісектрис і висот трикутника, \nякщо відомі три сторони a, b, c.")
a = float(input('Сторона a = '))
b = float(input('Сторона b = '))
c = float(input('Сторона c = '))
p = (a+b+c)/2
ma = math.sqrt(2*c**2+2*b**2-a**2)/2	#Застосуємо теорему Стюарта, згідно з якою квадрат медіани
mb = math.sqrt(2*a**2+2*c**2-b**2)/2	#дорівнює одній четвертій від суми подвоєних квадратів сторін
mc = math.sqrt(2*a**2+2*b**2-c**2)/2	#з якої відняли квадрат боку, до якої проведена медіана.	
print("Довжина медіани, опущеної на сторону a, = ", ma)
print("Довжина медіани, опущеної на сторону b, = ", mb)
print("Довжина медіани, опущеної на сторону c, = ", mc)
la = 2*math.sqrt(c*b*p*(p-a))/(c+b)
lb = 2*math.sqrt(a*c*p*(p-b))/(a+c)
lc = 2*math.sqrt(a*b*p*(p-c))/(a+b)
print("Довжина бісектриси, опущеної на сторону a, = ", la)
print("Довжина бісектриси, опущеної на сторону b, = ", lb)
print("Довжина бісектриси, опущеної на сторону c, = ", lc)
s = math.sqrt(p*(p-a)*(p-b)*(p-c))
ha = (2/a)*s
hb = (2/b)*s
hc = (2/c)*s
print("Довжина висоти, опущеної на сторону a, = ", ha)
print("Довжина висоти, опущеної на сторону b, = ", hb)
print("Довжина висоти, опущеної на сторону c, = ", hc)


#Задача 1.8=============================================================
import math
print("\n1.8. Обчислити відстань від точки (𝑥0, 𝑦0) до:")
print("a) заданої точки (x, y)")
x0 = float(input("x0 = "))
y0 = float(input("y0 = "))
x = float(input("x = "))
y = float(input("y = "))
s = math.sqrt((x-x0)**2+(y-y0)**2)
print("Відстань = %f" %s)

print("b) заданої прямої ax + by + c = 0")
a = float(input("Введіть коефіцієнт a = "))
b = float(input("Введіть коефіцієнт b = "))
c = float(input("Введіть коефіцієнт c = "))
x = float(input("Введіть x = "))
y = float(input("Введіть y = "))
d = (abs(a*x0+b*y0+c))/(math.hypot(a,b))
print("Відстань = %f" %d)

print("c) точки перетину прямих 𝑥 + 𝑏𝑦 + 𝑐 = 0 і 𝑎𝑥 + 𝑦 + 𝑐 = 0, де 𝑎𝑏 ≠ 1")
a = float(input("Введіть коефіцієнт a = "))
b = float(input("Введіть коефіцієнт b = "))
while a*b==1 :
   print("а*b=1 будь ласка введіть інше число ")
   b = float(input("b = "))
c = float(input("Введіть коефіцієнт c = "))
y = round((a*c-c)/(1-a*b))  #"round" округлення числа
x = -c-b*y
print("Координати перетину x=%i" %x)
print(                    "y=%u" %y)
s = math.sqrt((x-x0)**2+(y-y0)**2)
print("Відстань = %f" %s)


#Задача 1.9=============================================================
import math
print("\n1.9. Знайти об'єм циліндра, якщо відомо його радіус основи та висоту.")
r = float(input("Радіус основи = "))
h = float(input("Висота = "))
v = math.pi*r**2*h #Формула обєму для циліндра
print("Обєм = %f" %v)


#Задача 1.10============================================================
import math
print("\n1.10. Знайти об'єм конуса, якщо відомо його радіус основи та висоту.")
r = float(input("Радіус основи = "))
h = float(input("Висота = "))
v = (1/3)*math.pi*r**2*h #Формула обєму для конуса
print("Обєм = %f" %v)


#Задача 1.11============================================================
print("\n1.11. Без попередніх алгебраїчних перетворень обчислити значення \nарифметичного виразу:")
print("y=(c+a/(a^2+b^2))/(a+b/(b^2+c^2))")
a = float(input("a = "))
b = float(input("b = "))
c = float(input("c = "))
y = (c+a/(a**2+b**2))/(a+b/(b**2+c**2))
print("Відповідь = %f" %y)


#Задача 1.12============================================================
print("\n1.12. Скласти програми для розв'язання рівнянь:")
print("a) 4.2343𝑥 + 𝑏 = 𝑐;")
b = float(input("b = "))
c = float(input("c = "))
x = (c-b)/4.2343
print("Відповідь = %f" %x)

print("b) (5.23𝑥 + 𝑏)(𝑑 − 2.4c) = 0;")
b = float(input("b = "))
c = float(input("c = "))
d = float(input("d = "))
x = (0/(d-2.4*c)-b)/5.23
print("Відповідь = %f" %x)

print("c) 𝑎𝑥 + 𝑏 = 𝑐𝑥 + 𝑑, 𝑎 − 𝑐 ≠ 0,")
a = float(input("a = "))
b = float(input("b = "))
c = float(input("c ≠ a = "))
while c==a :
   print("Будь ласка введіть інше число ")
   c = float(input("c ≠ a = "))
d = float(input("d = "))
x = (d-b)/(a-c)
print("Відповідь = %f" %x)


#Задача 1.13============================================================
print("\n1.13. Дано дійсне число x. Користуючись тільки операцією множення, \nотримати:")
x = float(input("x = "))
print("a) x^4 за дві операції")
q = x*x
a = q*q
print("Відповідь = %f" %a)

print("b) x^6 за три операції")
q = x*x*x
b = q*q
print("Відповідь = %f" %b)

print("c) x^9 за чотири операції")
q = x*x
w = q*q
c = w*w*x
print("Відповідь = %f" %c)

print("d) x^15 за п'ять операцій")
q = x*x
w = q*x
e = q*w
d = e*e*e
print("Відповідь = %f" %d)

print("e) x^28 за шість операцій")
q = x*x
w = q*q
y = w*w
e = y*y*y*w
print("Відповідь = %f" %e)

print("f) x^64 за шість операцій")
q = x*x
w = q*q
y = w*w
e = y*y
r = e*e
f = r*r
print("Відповідь = %f" %f)


#Задача 1.14============================================================
print("\n1.14. Скласти програму для обчислення значення многочлена від двох \nзмінних для введеної з клавіатури пари чисел (𝑥, 𝑦):")
x = float(input("x = "))
y = float(input("y = "))
print("a) 𝑓(𝑥, 𝑦) = x^3+3*x^2*y+3*x*y^2+y^3")
a = x**3+3*x**2*y+3*x*y**2+y**3
print("Відповідь = %f" %a)

print("b) 𝑓(𝑥, 𝑦) = x^2*y^2+x^3*y^3+x^4*y^4")
b = x**2*y**2+x**3*y**3+x**4*y**4
print("Відповідь = %f" %b)

print("c) 𝑓(𝑥, 𝑦) = x+y+x^2+y^2+x^3+y^3+x^4+y^4")
c = x+y+x**2+y**2+x**3+y**3+x**4+y**4
print("Відповідь = %f" %c)


#Задача 1.15============================================================
print("\n1.15. Тіло починає рухатися без початкової швидкості з прискоренням а. \nОбчислити:")
v0 = 0
print("a) відстань, яку воно пройде за час 𝑡 від початку руху")
a = float(input("Прискорення = "))
t = float(input("Час = "))
s = v0*t+a*(t**2)/2
print("Відстань = %f" %s)

print("b) час, за який тіло досягне швидкості 𝑣")
v = float(input("Швидкість = "))
dt = (v-v0)/a
print("Час = %f" %dt)


#Задача 1.16============================================================
print("\n1.16. Обчислити кінетичну енергію тіла масою 𝑚, що рухається зі \nшвидкістю 𝑣 відносно поверхні Землі.")
m = float(input("Маса = "))
v = float(input("Швидкість = "))
e = (m*v**2)/2
print("Енергія = %f" %e)
